; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v4)
		(pred_4 ?v1)
		(pred_5 ?v5)
		(pred_3 ?v5)
		(pred_2 ?v1 ?v5)
		(pred_1)
		(pred_6 ?v1))

   (:action op_2
       :parameters  (?v2 ?v6)
       :precondition (and (not-eq ?v2 ?v6) 
                          (pred_5 ?v2) (pred_5 ?v6) (pred_3 ?v2))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v2))))


   (:action op_3
       :parameters (?v3 ?v7)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v7)
			    (pred_2 ?v3 ?v7) (pred_3 ?v7) (pred_1))
       :effect (and (pred_6 ?v3)
		    (not (pred_2 ?v3 ?v7)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v3  ?v7)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v7)
			    (pred_6 ?v3) (pred_3 ?v7))
       :effect (and (pred_2 ?v3 ?v7)
		    (pred_1)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_07 obj_02 
          obj_05 obj_03 obj_04 
)
(:init
(pred_5 obj_06)
(pred_5 obj_01)
(pred_5 obj_07)
(pred_5 obj_02)
(pred_4 obj_05)
(pred_4 obj_03)
(pred_4 obj_04)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(pred_1)
(pred_2 obj_05 obj_07)
(pred_2 obj_03 obj_02)
(pred_2 obj_04 obj_07)
(pred_3 obj_01)
)
(:goal
(and
(pred_2 obj_05 obj_02)
(pred_2 obj_03 obj_06)
(pred_2 obj_04 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_05 obj_02) (pred_3 obj_06))
    (sometime-before  (pred_2 obj_03 obj_06) (pred_3 obj_07))
    (sometime-before  (pred_2 obj_04 obj_06) (pred_3 obj_02))
  )
)
)

; plan
1. (op_2 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 0 of 3
2. (op_3 obj_04 obj_07)
   deleted: (pred_2 obj_04 obj_07) (pred_1)
   added: (pred_6 obj_04)
   goals met: 0 of 3
3. (op_2 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 0 of 3
4. (op_1 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_1)
   goals met: 0 of 3
5. (op_3 obj_03 obj_02)
   deleted: (pred_2 obj_03 obj_02) (pred_1)
   added: (pred_6 obj_03)
   goals met: 0 of 3
6. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_06)
   goals met: 0 of 3
7. (op_1 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_2 obj_03 obj_06) (pred_1)
   goals met: 1 of 3
8. (op_2 obj_06 obj_02)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_02)
   goals met: 1 of 3
9. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04 obj_02) (pred_1)
   added: (pred_6 obj_04)
   goals met: 1 of 3
10. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_06)
   goals met: 1 of 3
11. (op_1 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_2 obj_04 obj_06) (pred_1)
   goals met: 2 of 3
12. (op_2 obj_06 obj_07)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_07)
   goals met: 2 of 3
13. (op_3 obj_05 obj_07)
   deleted: (pred_2 obj_05 obj_07) (pred_1)
   added: (pred_6 obj_05)
   goals met: 2 of 3
14. (op_2 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 2 of 3
15. (op_1 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_2 obj_05 obj_02) (pred_1)
   goals met: 3 of 3
